package com.sentum.util;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class NumberUtils {

    public static String extractNumbers(String input) {

        // 正则表达式匹配整数和小数
        String regex = "-?\\d+(\\.\\d+)?";
        Pattern pattern = Pattern.compile(regex);
        Matcher matcher = pattern.matcher(input);

        while (matcher.find()) {
            return matcher.group();
        }

        return "0";
    }


    public static void removeTrailingZeros(JSON json) {
        if (json instanceof JSONObject) {
            JSONObject jsonObject = (JSONObject) json;
            for (String key : jsonObject.keySet()) {
                Object value = jsonObject.get(key);
                if (value instanceof Number) {
                    jsonObject.put(key, convertNumber((Number) value));
                } else if (value instanceof String) {
                    try {
                        // 尝试将字符串转换为双精度浮点数
                        double numberValue = Double.parseDouble((String) value);
                        jsonObject.put(key, convertNumber(numberValue));
                    } catch (NumberFormatException e) {
                        // 如果转换失败，保持原样
                    }
                } else if (value instanceof JSONObject || value instanceof JSONArray) {
                    removeTrailingZeros((JSON) value);
                }
            }
        } else if (json instanceof JSONArray) {
            JSONArray jsonArray = (JSONArray) json;
            for (int i = 0; i < jsonArray.size(); i++) {
                Object value = jsonArray.get(i);
                if (value instanceof Number) {
                    jsonArray.set(i, convertNumber((Number) value));
                } else if (value instanceof String) {
                    try {
                        // 尝试将字符串转换为双精度浮点数
                        double numberValue = Double.parseDouble((String) value);
                        jsonArray.set(i, convertNumber(numberValue));
                    } catch (NumberFormatException e) {
                        // 如果转换失败，保持原样
                    }
                } else if (value instanceof JSONObject || value instanceof JSONArray) {
                    removeTrailingZeros((JSON) value);
                }
            }
        }
    }

    private static Object convertNumber(Number number) {
        if (number instanceof Double || number instanceof Float) {
            return removeTrailingZerosFromDouble(number.doubleValue());
        } else if (number instanceof Long || number instanceof Integer) {
            return number.longValue();
        } else {
            return number;
        }
    }

    private static Object removeTrailingZerosFromDouble(double value) {
        if (value == (long) value) {
            return (long) value;
        } else {
            return value;
        }
    }


    static String x = "{\n" +
            "    \"msg\": \"success\",\n" +
            "    \"code\": 200,\n" +
            "    \"data\": {\n" +
            "        \"effectiveness\": {\n" +
            "            \"score\": \"16.0\",\n" +
            "            \"literature\": [],\n" +
            "            \"standardsGuide\": [\n" +
            "                {\n" +
            "                    \"zdz\": \"武汉大学中南医院新型冠状病毒感染的肺炎防治课题组\",\n" +
            "                    \"isPaper\": 0,\n" +
            "                    \"showField\": \"新型冠状病毒（2019-nCoV)感染的肺炎诊疗快速建议指南（完整版）-武汉大学中南医院新型冠状病毒感染的肺炎防治课题组-2020-02-01\",\n" +
            "                    \"fdaDate\": \"2020-02-01\",\n" +
            "                    \"id\": \"65ee719d7a9dc3051714a937\",\n" +
            "                    \"title\": \"新型冠状病毒（2019-nCoV)感染的肺炎诊疗快速建议指南（完整版）\",\n" +
            "                    \"type\": \"1\",\n" +
            "                    \"content\": \"2临床表现2：乏力伴发热，推荐中成药：金花清感颗粒、连花清瘟胶囊（颗粒）、疏风解毒胶囊（颗粒）、防风通圣丸（颗粒）。临床表现：恶寒无汗，头痛身重，肢体烦疼，胸隔痞满，渴不欲饮，便沥不爽，溺短而黄。推荐处方：藿香正气散加减（《全国名医验案之类编》之阴湿伤表案）。组成：紫苏叶10 g、苍术15g、白芷10g、陈皮10g、羌活 10g、藿香10g（后下）、厚朴 10 g、防风10g、茯苓皮15g、通草10 g。推荐中成药：藿香正气胶囊、藿香正气水。临床表现：恶寒发热或无热，干咳，咽干，倦怠无力，胸闷，脘痞或呕恶，便唐。古质淡或淡红，苔白腻，脉濡。推荐处方：苍术 15 g、陈皮10 g、厚朴10 g、藿香10 g（后下）、草果6g、生麻黄6g、羌活10g、生姜10g、槟榔10g（后下）、蝉蜕10g、僵蚕10g、片姜黄10 g。临床表现：身热不退或往来寒热，咳嗽痰热，或有黄痰，腹胀便秘。胸闷气促，咳嗽憋喘，动则气喘，舌质红，苔黄腻或黄燥，脉滑数。推荐处方：杏仁10g、生石膏30g（先煎）、瓜萎30g、生大黄6g（后下）、生炙麻黄各6g、子 10 g、桃仁10 g、草果6g、槟榔10g，苍术10g推荐中成药：喜炎平注射液、而必净注射液。临床表现：身体壮热，胸闷气促，面色紫黑，唇色黑焦肿，神识昏迷。舌绛紫苔黄燥，脉洪大弦数。推荐处方：三黄石膏汤合升降散合解毒活血汤。组成：炙麻黄10 g、杏仁10 g、生石膏20-30 g、蝉衣 10 g、僵蚕 10g、姜黄10g、酒大黄10 g、黄芩 10 g、黄连5g、连翘 15 g、当归 10g、桃仁 10 g、赤芍 15g、生地15 g。\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"zdz\": \"中华人民共和国国家卫生健康委员会\",\n" +
            "                    \"isPaper\": 0,\n" +
            "                    \"showField\": \"新型冠状病毒肺炎诊疗方案（试行第六版）-中华人民共和国国家卫生健康委员会-2020-02-19\",\n" +
            "                    \"fdaDate\": \"2020-02-19\",\n" +
            "                    \"id\": \"65ee719c7a9dc3051714a8d2\",\n" +
            "                    \"title\": \"新型冠状病毒肺炎诊疗方案（试行第六版）\",\n" +
            "                    \"type\": \"1\",\n" +
            "                    \"content\": \"1．医学观察期临床表现1：乏力伴胃肠不适推荐中成药：藿香正气胶囊（丸、水、口服液）临床表现2：乏力伴发热推荐中成药：金花清感颗粒、连花清瘟胶囊（颗粒）、疏风解毒胶囊（颗粒）2．临床治疗期（确诊病例）适用范围：适用于轻型、普通型、重型患者，在危重型患者救治中可结合患者实际情况合理使用。基础方剂：麻黄9g、炙甘草6g、杏仁9g、生石膏15～30g（先煎）、桂枝9g、泽泻9g、猪苓9g、白术9g、茯苓15g、柴胡16g、黄芩6g、姜半夏9g、生姜9g、紫菀9g、冬花9g、射干9g、细辛6g、山药12g、枳实6g、陈皮6g、藿香9g。服法：传统中药饮片，水煎服。每天一付，早晚两次（饭后四十分钟），温服，三付一个疗程。如有条件，每次服完药可加服大米汤半碗，舌干津液亏虚者可多服至一碗。（注：如患者不发热则生石膏的用量要小，发热或壮热可加大生石膏用量）。若症状好转而未痊愈则服用第二个疗程，若患者有特殊情况或其他基础病，第二疗程可以根据实际情况修改处方，症状消失则停药。\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"classicFormula\": \"\",\n" +
            "            \"scoreDescribe\": \"连花清瘟胶囊在有效性上的得分为：16.0分\",\n" +
            "            \"guide\": [\n" +
            "                {\n" +
            "                    \"zdz\": \"中国医疗保健国际交流促进会\",\n" +
            "                    \"isPaper\": 0,\n" +
            "                    \"showField\": \"新型冠状病毒肺炎药物预防、诊断、治疗与出院管理循证临床实践指南（更新版）-中国医疗保健国际交流促进会-2020-10-16\",\n" +
            "                    \"fdaDate\": \"2020-10-16\",\n" +
            "                    \"id\": \"65ee71987a9dc3051714a34d\",\n" +
            "                    \"title\": \"新型冠状病毒肺炎药物预防、诊断、治疗与出院管理循证临床实践指南（更新版）\",\n" +
            "                    \"type\": \"1\",\n" +
            "                    \"content\": \"证据总结：一项队列研究l\\\"%显示，与常规抗病毒治疗（奥司他韦、阿比多尔、洛比那韦/利托那韦）（n=30)相比，清肺排毒汤联合常规抗病毒药物治疗（n=30)患者的住院时间[（13．633±0．398）dvs．(16．433±0．295)d，P<0．05]、退热时间[(2．346±0．852)dvs．（3．852±0．774)d，P<0．05]、肺部CT好转所需时间[（6．71±0．497)dvs．（8．800±0．395)d，P<0．05」均显著缩短，病情加重情况(20．0%vs．40．0%，P>0．05)和治愈率（90．0%vs．83．3%，P>0．05)无显著差异。联合用药组出现的不良反应较少[1例（心）vs．3例（恶心2例、腹泻1例）。推荐理由：已有的证据非常薄弱，但考虑到患者的偏好、可接受性、可行性，经过利弊权衡，70%以上的指南专家组成员认为清肺排毒汤可能是COVID-19患者的一种治疗选择，给予基于共识的推荐意见。3个正在进行的临床试验的结果将为这种治疗方案提供证据。但考虑到一些国家中医药治疗缺乏可推广性，缺乏可信的证据，本团队最终将其确定为“基于共识的建议”题21：生化洁改善临床结推荐意见：推荐连花清瘟联合常规疗法（包括营养支持治疗、对症治疗、抗病毒和抗菌治疗)治疗轻型、普通型COVID-19患者（Grade2C)。化情次/d，疗程14d。证据总结：一项RCT\\\"\\\"显示，与阿比多尔治疗组（148例轻型患者)相比，连花清瘟颗粒联合阿比多尔(147例轻型患者)治疗7d后，中医证候积分（基于中医证候评定量表)明显降低（P<0．05)，治疗总有效率（显效率+有效率）显著提高（81．0%vs．64．9%，P<0．05)，肺部CT改善率差异无统计学意义（69．4%vs．62．8%，P>0．05）：两组均未出现严重不良反应。另一项RCTl9显示，与常规治疗（氧疗、抗病毒治疗和对症治疗)(n=142)相比，连花清瘟胶囊联合常规疗法（n=142)治疗14d后，恢复率、肺部CT改善率、临床治愈率显著提高（91．5%vs．82．4%，P<0．05；83．8%vs．64．1%，P<0．001；78．9%vs．66．2%，P<0．05)，中位症状恢复时间、退热时间显著缩短（7dvs．10d，P<0．001；2dvs．3d，P<0．001)；然而，两组转为严重患者的比例及病毒检测结果无显著差异(P>0．05)，且均未出现严重不良反应。\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"zdz\": \"湖南省中医药管理局\",\n" +
            "                    \"isPaper\": 0,\n" +
            "                    \"showField\": \"湖南省新冠肺炎中医药防治方案（2022年第二版）-湖南省中医药管理局-2022-12-02\",\n" +
            "                    \"fdaDate\": \"2022-12-02\",\n" +
            "                    \"id\": \"65ee71887a9dc30517149083\",\n" +
            "                    \"title\": \"湖南省新冠肺炎中医药防治方案（2022年第二版）\",\n" +
            "                    \"type\": \"1\",\n" +
            "                    \"content\": \"【参考中成药】金花清感颗粒、连花清瘟颗粒（胶囊）、双黄连颗粒（口服液）、银黄清肺胶囊、蒲地蓝消炎片、清肺排毒颗粒等。【症状】纳差，大便沥，恶心欲呕，或腹胀，疲乏，舌苔薄黄或黄腻，脉濡数。【治法】清热化浊，理气运脾【主方】加减藿朴夏苓汤【参考方药】黄连6g厚朴10g法半夏10g藿香10g茯苓15g猪苓10g滑石（包煎）20g豆蔻10g苦杏仁10g薏苡仁20g通草6g泽泻6g服法：每日1剂，水煎400ml，每日2次。【参考中成药】藿香正气颗粒（丸）、双黄连颗粒（口服液）、化湿败毒颗粒。儿童方【治法】辛凉透邪【主方】加减银翘散【参考方药】金银花5g连翘5g桔梗3g牛蒡子6g荆芥5g芦根10g淡竹叶5g桑叶5g菊花5g神曲(包愈)6g薄荷(后下)3g苦杏仁6g服法：每日1剂，水煎100~200ml，每次服用50~100ml，每日 2次 。【参考中成药】莲花清瘟颗粒、喉咽清口服液（颗粒）、小儿肺热咳喘口服液、小儿荆杏止咳颗粒、金叶败毒颗粒、麻杏宣肺颗粒等。【症状】初起发热或无发热，恶风寒，乏力，咳嗽，有痰或少痰，头身重痛，气短，口千，脘痞，或有便，舌红，苔白或黄或腻，脉滑数。本证见于轻型和部分普通型病例。【治法】宣肺化浊，解毒透邪【主方】麻杏苡甘汤加味【参考方药】炙麻黄6g苦杏仁10g薏苡仁20g黄芩15g知母10g金银花15g连翘15g藿香10g浙贝母15g甘草6g【加减】发热重加生石膏30g（先煎）、地骨皮15g。服法：每日1剂，水煎 400ml，每日2次。【参考中成药】金花清感颗粒、连花清瘟颗粒（胶囊）、双黄连颗粒（口服液）、银黄清肺胶囊、宣肺败毒颗粒等。\"\n" +
            "                }\n" +
            "            ]\n" +
            "        },\n" +
            "        \"security\": {\n" +
            "            \"specialCrowd_pregnantWomen\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"上市后监测数据显示本品可见以下胃肠道不良反应如恶心、呕吐、腹痛、腹泻、腹胀、反胃，以及皮疹、瘙痒、口干、头晕等。\\n\"\n" +
            "            },\n" +
            "            \"safetyEvaluation\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"上市后监测数据显示本品可见以下胃肠道不良反应如恶心、呕吐、腹痛、腹泻、腹胀、反胃，以及皮疹、瘙痒、口干、头晕等。\\n\"\n" +
            "            },\n" +
            "            \"adverseEventScore\": 1,\n" +
            "            \"adverseEventContent\": [],\n" +
            "            \"reviseScore\": 1,\n" +
            "            \"specialCrowd_children\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连花清瘟胶囊是由石家庄以岭药业股份有限公司生产的一种药物，主要用于治疗流感及上呼吸道感染等症状。这种药物的主要成分是中药提取物，具有清热解毒、疏风散寒的功效。关于儿童用药，连花清瘟胶囊的使用需遵循医生的建议。由于儿童的身体发育和代谢特点与成年人不同，剂量和用药安全性需要特别注意。此外，具体的适应症、禁忌症和使用注意事项也应咨询医生或药师，以确保孩子用药的安全和有效。在使用任何药物前，特别是儿童用药，请务必遵循专业医疗人员的指导。同时，阅读药品说明书也是十分重要的。\"\n" +
            "            },\n" +
            "            \"specialCrowd_renkong\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"上市后监测数据显示本品可见以下胃肠道不良反应如恶心、呕吐、腹痛、腹泻、腹胀、反胃，以及皮疹、瘙痒、口干、头晕等。\\n\"\n" +
            "            },\n" +
            "            \"scoreDescribe\": \"连花清瘟胶囊在安全性上的得分为：11.0分\",\n" +
            "            \"otherScore\": \"2.0\",\n" +
            "            \"score\": \"11.0\",\n" +
            "            \"specialScore\": \"3.0\",\n" +
            "            \"adverseReactionRating\": {\n" +
            "                \"score\": \"4.0\",\n" +
            "                \"content\": \"上市后监测数据显示本品可见以下胃肠道不良反应如恶心、呕吐、腹痛、腹泻、腹胀、反胃，以及皮疹、瘙痒、口干、头晕等。\\n\"\n" +
            "            },\n" +
            "            \"specialCrowd_geriatric\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连花清瘟胶囊是一种中成药，主要用于感冒、流感等引起的发热、咳嗽、咽喉疼痛等症状的缓解。该药物由石家庄以岭药业股份有限公司生产，药物成分通常包含多种中药材，具有清热解毒、宣肺止咳的功效。在老年人用药时，建议遵循以下几点：1. 遵医嘱：老年人在使用任何药物前，最好咨询医生，以获取专业建议。2. 注意剂量：老年人的身体代谢可能较慢，使用药物时需特别注意剂量，避免过量。3. 副作用监测：观察服药后的反应，若出现不适，应立即停药并就医。4. 配合其他药物：如果老年人有其他基础疾病，务必告知医生，以避免药物相互作用。总之，使用连花清瘟胶囊或任何其他药物时，都应在专业医疗人员的指导下进行。在使用中成药时，有些人可能对某些成分过敏，使用前要确认成分的安全性。\"\n" +
            "            },\n" +
            "            \"adverseEventAddContent\": [],\n" +
            "            \"reviseContent\": [],\n" +
            "            \"specialCrowd_liver\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"上市后监测数据显示本品可见以下胃肠道不良反应如恶心、呕吐、腹痛、腹泻、腹胀、反胃，以及皮疹、瘙痒、口干、头晕等。\\n\"\n" +
            "            },\n" +
            "            \"OTC\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"本药为OTC甲\"\n" +
            "            }\n" +
            "        },\n" +
            "        \"total\": {\n" +
            "            \"drugName\": \"连花清瘟胶囊\",\n" +
            "            \"time\": \"2024-12-12\",\n" +
            "            \"title\": \"连花清瘟胶囊临床综合评价\",\n" +
            "            \"totalScore\": 63.0,\n" +
            "            \"dimensionDiagram\": [\n" +
            "                {\n" +
            "                    \"max\": 18,\n" +
            "                    \"name\": \"安全性\",\n" +
            "                    \"value\": \"11.0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"max\": 11,\n" +
            "                    \"name\": \"适用性\",\n" +
            "                    \"value\": \"9.0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"max\": 20,\n" +
            "                    \"name\": \"有效性\",\n" +
            "                    \"value\": \"16.0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"max\": 15,\n" +
            "                    \"name\": \"经济性\",\n" +
            "                    \"value\": 15.0\n" +
            "                },\n" +
            "                {\n" +
            "                    \"max\": 14,\n" +
            "                    \"name\": \"药学特性\",\n" +
            "                    \"value\": \"9.0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"max\": 22,\n" +
            "                    \"name\": \"政策准入\",\n" +
            "                    \"value\": \"3.0\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"drugNameDetail\": \"连花清瘟胶囊-每粒装0.35g-石家庄以岭药业股份有限公司\"\n" +
            "        },\n" +
            "        \"reportId\": \"cykJxsdQRP3CbOj1pggu9\",\n" +
            "        \"pharmacy\": {\n" +
            "            \"modernResearch_effectiveness\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"针对连花清瘟胶囊的有效性评价，临床试验结果表明其对于缓解感冒症状、新冠相关症状的效果显著，尤其是在轻症患者中表现突出。相关研究也表明其可以缩短疾病的持续时间，提升患者的生活质量。\"\n" +
            "            },\n" +
            "            \"score\": \"9.0\",\n" +
            "            \"modernResearch_fingerprint\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连花清瘟胶囊是一种常用的中药复方制剂，主要用于治疗流感及新型冠状病毒引起的相关症状。指纹图谱研究通常是用于药物质量控制和成分分析的一种技术，能够提供药物中主要成分的定性和定量信息。在连花清瘟胶囊的指纹图谱研究中，通常涉及以下几个方面：1. 成分提取：使用适当的溶剂（如水，乙醇等）提取胶囊中的有效成分。2. 色谱分析：运用高效液相色谱（HPLC）或气相色谱（GC）等技术，对提取液进行分析，绘制指纹图谱。3. 指纹图谱的建立：通过分析各种条件下得到的色谱图，确定主要成分的保留时间和峰面积，建立标准指纹图谱。4. 质谱分析：结合质谱（MS）技术对分离的成分进行进一步的结构鉴定，提高对成分的理解。5. 对比研究：将所建立的指纹图谱与市售同类产品或国家标准进行对比，评估其质量和稳定性。6. 数据分析：利用现代数据处理软件对指纹图谱进行分析，以识别潜在的标志性成分，从而为药物的有效性和安全性提供依据。这样的研究不仅能够确保连花清瘟胶囊的质量，还可以推动相关领域的标准化和科学化发展。如果需要具体的实验设计或分析结果，建议查阅相关的药学文献或专业领域的研究报告。\"\n" +
            "            },\n" +
            "            \"modernResearch_pharmacology\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连花清瘟胶囊是一种中成药，主要用于防治流感及类似的病毒感染。其药理作用包括以下几个方面：1. 清热解毒：连花清瘟胶囊含有多种中药成分，能够清热解毒，帮助缓解因感染引起的发热、咳嗽等症状。2. 抗病毒作用：研究表明，该药对某些病毒（如流感病毒）具有抑制作用，可以帮助减轻病毒感染带来的不适。3. 免疫调节：连花清瘟胶囊可以增强机体的免疫功能，帮助抵御感染。4. 抗炎作用：其成分能够减轻呼吸道的炎症反应，缓解咳嗽、咽喉痛等症状。需要注意的是，使用连花清瘟胶囊时，应遵循医生的建议，结合具体情况进行使用。\"\n" +
            "            },\n" +
            "            \"drugComposition\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连翘、金银花、炙麻黄、炒苦杏仁、石膏、板蓝根、绵马贯众、鱼腥草、广藿香、大黄、红景天、薄荷脑、甘草。辅料为玉米淀粉。\\n\"\n" +
            "            },\n" +
            "            \"modernResearchScore\": \"4.0\",\n" +
            "            \"scoreDescribe\": \"连花清瘟胶囊在药学性上的得分为：9.0分\",\n" +
            "            \"storage\": {\n" +
            "                \"score\": \"2.0\",\n" +
            "                \"content\": \"密封，置阴凉处（不超过 20 ℃ ）。\\n\"\n" +
            "            },\n" +
            "            \"validity\": {\n" +
            "                \"score\": \"2.0\",\n" +
            "                \"content\": \"30 个月\\n\"\n" +
            "            },\n" +
            "            \"modernResearch_contentDetection\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连花清瘟胶囊的含量测定方法主要采用高效液相色谱法（HPLC）。该方法具有高灵敏度及准确性，通过标准曲线计算样品中活性成分的含量。\"\n" +
            "            }\n" +
            "        },\n" +
            "        \"applicability\": {\n" +
            "            \"score\": \"9.0\",\n" +
            "            \"instructionAdverseReaction\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"胶囊剂\"\n" +
            "            },\n" +
            "            \"dependability\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"本产品为:胶囊剂\\n口服。一次 4 粒，一日 3 次。\\n\"\n" +
            "            },\n" +
            "            \"drugChoice\": {\n" +
            "                \"score\": \"5.0\"\n" +
            "            },\n" +
            "            \"unclear\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"暂无内容\"\n" +
            "            },\n" +
            "            \"instructionAttribute\": {\n" +
            "                \"score\": \"2.0\",\n" +
            "                \"content\": \"清瘟解毒，宣肺泄热。用于治疗流行性感冒属热毒袭肺证，症见：发热或高热，恶寒，肌肉酸痛，鼻塞流涕，咳嗽，头痛，咽干咽痛，舌偏红，苔黄或黄腻等。\\n\"\n" +
            "            },\n" +
            "            \"scoreDescribe\": \"连花清瘟胶囊在适用性上的得分为：9.0分\",\n" +
            "            \"instructionScore\": \"4.0\"\n" +
            "        },\n" +
            "        \"_id\": {\n" +
            "            \"timestamp\": 1733995045,\n" +
            "            \"date\": \"2024-12-12T09:17:25.000+00:00\"\n" +
            "        },\n" +
            "        \"economicViability\": {\n" +
            "            \"score\": \"15.0\",\n" +
            "            \"scoreDescribe\": \"连花清瘟胶囊在经济性上的得分为：15.0分\",\n" +
            "            \"content\": \"待遴选药品日均治疗费用最低，得15分。\"\n" +
            "        },\n" +
            "        \"policy\": {\n" +
            "            \"nationalSecrecy\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"连花清瘟胶囊为非国家保护品种\"\n" +
            "            },\n" +
            "            \"score\": \"3.0\",\n" +
            "            \"intellectualScore\": \"4.0\",\n" +
            "            \"patent\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"连花清瘟胶囊相关的专利技术主要包括其特定的配方和成分组合。该药在新冠期间的有效性强化了其申请专利的积极性。此外，连花清瘟在相关的抗病毒和中药现代化研究中获得了多项奖项，且受到了政府和学术界的重视。\"\n" +
            "            },\n" +
            "            \"medicalInsurance\": {\n" +
            "                \"score\": \"3.0\",\n" +
            "                \"content\": \"甲\"\n" +
            "            },\n" +
            "            \"scoreDescribe\": \"连花清瘟胶囊在政策准入上的得分为：3.0分\",\n" +
            "            \"show_manufacturers\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"截至我最后的知识更新（2023年10月），石家庄以岭药业股份有限公司在中国制药企业中具有一定的影响力。然而，具体的排名情况会随着年份和评选标准的变化而变化，因此建议查阅最新的行业报告或相关机构发布的排名信息，以获取准确的数据。通常，石家庄以岭药业在医药工业百强榜中表现良好，因其在中药、创新药物等领域的研发和市场表现得到认可。如果需要最新的排名情况，建议访问相关的官方网站或查阅最新的行业分析报告。\"\n" +
            "            },\n" +
            "            \"basicMedicine\": {\n" +
            "                \"score\": \"1.0\",\n" +
            "                \"content\": \"暂无内容\"\n" +
            "            },\n" +
            "            \"chineseMedicine\": {\n" +
            "                \"score\": \"0.0\",\n" +
            "                \"content\": \"本品未收录在《中国药典》中。\"\n" +
            "            }\n" +
            "        }\n" +
            "    }\n" +
            "}";


}

